NASAsc2-0410/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    frontAndBack
    {
        type            patch;
        nFaces          1472;
        startFace       3179468;
    }
    inlet
    {
        type            patch;
        nFaces          598;
        startFace       3180940;
    }
    outlet
    {
        type            patch;
        nFaces          598;
        startFace       3181538;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          832;
        startFace       3182136;
    }
    upperWall
    {
        type            patch;
        nFaces          832;
        startFace       3182968;
    }
    NASAsc2-0410
    {
        type            wall;
        inGroups        2(NASAsc2-0410Group wall);
        nFaces          14474;
        startFace       3183800;
    }
)

// ************************************************************************* //
